via/viaems/src/platforms/stm32f4-discovery.c
#include <stdatomic.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#include <assert.h>

#include <libopencm3/cm3/cortex.h>
#include <libopencm3/cm3/dwt.h>
#include <libopencm3/cm3/nvic.h>
#include <libopencm3/cm3/scb.h>
#include <libopencm3/cm3/systick.h>
#include <libopencm3/stm32/adc.h>
#include <libopencm3/stm32/dma.h>
#include <libopencm3/stm32/exti.h>
#include <libopencm3/stm32/flash.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/stm32/iwdg.h>
#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/spi.h>
#include <libopencm3/stm32/syscfg.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/usb/cdc.h>
#include <libopencm3/usb/usbd.h>

#include "config.h"
#include "decoder.h"
#include "limits.h"
#include "platform.h"
#include "scheduler.h"
#include "sensors.h"
#include "tasks.h"
#include "util.h"

#include "stm32_sched_buffers.h"

/* Hardware setup:
 *  Discovery board LEDs:
 *  LD3 - Orange - PD13
 *  LD4 - Green - PD12
 *  LD5 - Red - PD14
 *  LD6 - Blue - PD15
 *
 *  Fixed pin mapping:
 *  Primary time base is TIM2, slaved off TIM8
 *  Trigger 0 - PA0 (TIM2_CH1)
 *  Trigger 1 - PA1 (TIM2_CH2)
 *
 *  Test/Out Trigger 0 - PB10
 *  Test/Out Trigger 1 - PB11
 *
 *  Event Timer (TIM2_CH4)
 *
 *  CAN2:
 *    PB5, PB6
 *
 *  USB:
 *    PA9, PA11, PA12
 *
 *  TLC2543 or ADC7888 on SPI2 (PB12-15) CS, SCK, MISO, MOSI
 *    - Uses TIM7 dma1 stream 2 chan 1 to trigger DMA at about 50 khz for 10
 *      inputs
 *    - RX uses SPI2 dma1 stream 3 chan 0
 *    - On end of RX dma, trigger interrupt
 *
 *  Configurable pin mapping:
 *  Scheduled Outputs:
 *   - 0-15 maps to port D, pins 0-15
 *  PWM Outputs
 *   - 0-PC6  1-PC7 2-PC8 3-PC9 TIM3 channel 1-4
 *  GPIO (Digital Sensor or Output)
 *   - 0-15 Maps to Port E
 *
 *  nvic priorities:
 *    tim6 (test trigger) 0
 *    dma2s1 (buffer swap) 16
 *    tim2 (triggers, callbacks, scheduling, fueling calcs) 32
 *    dma1s3 (adc) 64
 *    otg (usb) 128
 *    systick 128
 */

static int capture_edge_from_config(trigger_edge e) {
  switch (e) {
  case RISING_EDGE:
    return TIM_IC_RISING;
  case FALLING_EDGE:
    return TIM_IC_FALLING;
  case BOTH_EDGES:
    return TIM_IC_BOTH;
  }
  return RISING_EDGE;
}

static void platform_setup_tim2() {
  /* Set up TIM2 as 32bit clock that is slaved off TIM8*/

  timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE, TIM_CR1_DIR_UP);
  timer_slave_set_mode(TIM2, TIM_SMCR_SMS_ECM1);
  timer_slave_set_trigger(TIM2, TIM_SMCR_TS_ITR1); /* TIM2 slaved off TIM8 */
  timer_set_period(TIM2, 0xFFFFFFFF);
  timer_set_prescaler(TIM2, 0);
  timer_disable_preload(TIM2);
  timer_continuous_mode(TIM2);
  /* Setup output compare registers */
  timer_disable_oc_output(TIM2, TIM_OC1);
  timer_disable_oc_output(TIM2, TIM_OC2);
  timer_disable_oc_output(TIM2, TIM_OC3);
  timer_disable_oc_output(TIM2, TIM_OC4);

  timer_set_oc_slow_mode(TIM2, TIM_OC4);
  timer_set_oc_mode(TIM2, TIM_OC4, TIM_OCM_FROZEN);

  /* Setup input captures for CH1-4 Triggers */
  gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLDOWN, GPIO0);
  gpio_set_af(GPIOA, GPIO_AF1, GPIO0);
  gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLDOWN, GPIO1);
  gpio_set_af(GPIOA, GPIO_AF1, GPIO1);

  timer_ic_set_input(TIM2, TIM_IC1, TIM_IC_IN_TI1);
  timer_ic_set_filter(TIM2, TIM_IC1, TIM_IC_CK_INT_N_2);
  timer_ic_set_polarity(
    TIM2, TIM_IC1, capture_edge_from_config(config.freq_inputs[0].edge));
  timer_ic_enable(TIM2, TIM_IC1);

  timer_ic_set_input(TIM2, TIM_IC2, TIM_IC_IN_TI2);
  timer_ic_set_filter(TIM2, TIM_IC2, TIM_IC_CK_INT_N_2);
  timer_ic_set_polarity(
    TIM2, TIM_IC2, capture_edge_from_config(config.freq_inputs[1].edge));
  timer_ic_enable(TIM2, TIM_IC2);

  timer_enable_counter(TIM2);
}

void platform_setup_tim8() {
  /* Set up TIM8 to cause an update event at 4 MHz */
  timer_set_mode(TIM8, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE, TIM_CR1_DIR_UP);
  timer_set_period(TIM8, 41); /* 0.25 uS */
  timer_set_prescaler(TIM8, 0);
  timer_disable_preload(TIM8);
  timer_continuous_mode(TIM8);
  timer_disable_oc_output(TIM8, TIM_OC1);
  timer_disable_oc_output(TIM8, TIM_OC2);
  timer_disable_oc_output(TIM8, TIM_OC3);
  timer_disable_oc_output(TIM8, TIM_OC4);
  timer_set_master_mode(TIM8, TIM_CR2_MMS_UPDATE);
  timer_enable_counter(TIM8);
  timer_enable_update_event(TIM8);
  timer_update_on_overflow(TIM8);
  timer_set_dma_on_update_event(TIM8);
  TIM8_DIER |= TIM_DIER_UDE; /* Enable update dma */
}

static void platform_init_eventtimer() {

  platform_setup_tim2();

  /* Only enable interrupts for trigger/sync inputs */
  if (config.freq_inputs[0].type == TRIGGER) {
    timer_enable_irq(TIM2, TIM_DIER_CC1IE);
  }
  if (config.freq_inputs[1].type == TRIGGER) {
    timer_enable_irq(TIM2, TIM_DIER_CC2IE);
  }

  nvic_enable_irq(NVIC_TIM2_IRQ);
  nvic_set_priority(NVIC_TIM2_IRQ, 32);

  /* Set debug unit to stop the timer on halt */
  *((volatile uint32_t *)0xE0042008) |= 29; /*TIM2, TIM5, and TIM7 and */
  *((volatile uint32_t *)0xE004200C) |= 2;  /* TIM8 stop */

  platform_setup_tim8();
}

static void platform_init_pwm() {

  gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO6);
  gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO7);
  gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO8);
  gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO9);
  gpio_set_af(GPIOC, GPIO_AF2, GPIO6);
  gpio_set_af(GPIOC, GPIO_AF2, GPIO7);
  gpio_set_af(GPIOC, GPIO_AF2, GPIO8);
  gpio_set_af(GPIOC, GPIO_AF2, GPIO9);

  timer_disable_oc_output(TIM3, TIM_OC1);
  timer_set_mode(TIM3, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE, TIM_CR1_DIR_UP);
  /* 30ish Hz */
  timer_set_period(TIM3, 65535);
  timer_set_prescaler(TIM3, 32);
  timer_enable_preload(TIM3);
  timer_continuous_mode(TIM3);
  /* Setup output compare registers */
  timer_ic_set_input(TIM3, TIM_IC1, TIM_IC_OUT);
  timer_disable_oc_clear(TIM3, TIM_OC1);
  timer_enable_oc_preload(TIM3, TIM_OC1);
  timer_set_oc_slow_mode(TIM3, TIM_OC1);
  timer_set_oc_mode(TIM3, TIM_OC1, TIM_OCM_PWM1);
  timer_set_oc_value(TIM3, TIM_OC1, 0);
  timer_set_oc_polarity_high(TIM3, TIM_OC1);
  timer_enable_oc_output(TIM3, TIM_OC1);

  timer_ic_set_input(TIM3, TIM_IC2, TIM_IC_OUT);
  timer_disable_oc_clear(TIM3, TIM_OC2);
  timer_enable_oc_preload(TIM3, TIM_OC2);
  timer_set_oc_slow_mode(TIM3, TIM_OC2);
  timer_set_oc_mode(TIM3, TIM_OC2, TIM_OCM_PWM1);
  timer_set_oc_value(TIM3, TIM_OC2, 0);
  timer_set_oc_polarity_high(TIM3, TIM_OC2);
  timer_enable_oc_output(TIM3, TIM_OC2);

  timer_ic_set_input(TIM3, TIM_IC3, TIM_IC_OUT);
  timer_disable_oc_clear(TIM3, TIM_OC3);
  timer_enable_oc_preload(TIM3, TIM_OC3);
  timer_set_oc_slow_mode(TIM3, TIM_OC3);
  timer_set_oc_mode(TIM3, TIM_OC3, TIM_OCM_PWM1);
  timer_set_oc_value(TIM3, TIM_OC3, 0);
  timer_set_oc_polarity_high(TIM3, TIM_OC3);
  timer_enable_oc_output(TIM3, TIM_OC3);

