via/viaems/src/platforms/stm32f4-discovery.c
  .interface = ifaces,
};

static const char *const usb_strings[] = {
  "https://github.com/via/viaems/",
  "ViaEMS console",
  "0",
};

void otg_fs_isr() {
  usbd_poll(usbd_dev);
}

void platform_init_usb() {

  gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO11 | GPIO12);
  gpio_set_af(GPIOA, GPIO_AF10, GPIO11 | GPIO12);

  usbd_dev = usbd_init(&otgfs_usb_driver,
                       &dev,
                       &usb_config,
                       usb_strings,
                       3,
                       usbd_control_buffer,
                       sizeof(usbd_control_buffer));

  usbd_register_set_config_callback(usbd_dev, cdcacm_set_config);
  nvic_enable_irq(NVIC_OTG_FS_IRQ);
  nvic_set_priority(NVIC_OTG_FS_IRQ, 128);
}

static void setup_task_handler() {
  /* Set up systick for 100 hz */
  systick_set_reload(1680000);
  systick_set_clocksource(STK_CSR_CLKSOURCE_AHB);
  systick_counter_enable();
  nvic_set_priority(NVIC_SYSTICK_IRQ, 128);
  systick_interrupt_enable();

  /* Setup IWDG to reset if we pass 30 mS without an interrupt */
  iwdg_set_period_ms(30);
  iwdg_start();
}

void platform_benchmark_init() {
  rcc_clock_setup_pll(&rcc_hse_8mhz_3v3[RCC_CLOCK_3V3_168MHZ]);
  rcc_wait_for_osc_ready(RCC_HSE);
  rcc_periph_clock_enable(RCC_SYSCFG);
  rcc_periph_clock_enable(RCC_GPIOA);
  rcc_periph_clock_enable(RCC_GPIOE);
  rcc_periph_clock_enable(RCC_OTGFS);
  gpio_mode_setup(GPIOE, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, 0xFFFF);
  dwt_enable_cycle_counter();
  platform_init_usb();
}

void platform_init(int argc, char *argv[]) {
  (void)argc;
  (void)argv;

  /* 168 Mhz clock */
  rcc_clock_setup_pll(&rcc_hse_8mhz_3v3[RCC_CLOCK_3V3_168MHZ]);

  /* Enable clocks for subsystems */
  rcc_periph_clock_enable(RCC_GPIOA);
  rcc_periph_clock_enable(RCC_GPIOB);
  rcc_periph_clock_enable(RCC_GPIOC);
  rcc_periph_clock_enable(RCC_GPIOD);
  rcc_periph_clock_enable(RCC_GPIOE);
  rcc_periph_clock_enable(RCC_SYSCFG);
  rcc_periph_clock_enable(RCC_DMA1);
  rcc_periph_clock_enable(RCC_DMA2);
  rcc_periph_clock_enable(RCC_TIM1);
  rcc_periph_clock_enable(RCC_TIM2);
  rcc_periph_clock_enable(RCC_TIM3);
  rcc_periph_clock_enable(RCC_TIM6);
  rcc_periph_clock_enable(RCC_TIM7);
  rcc_periph_clock_enable(RCC_TIM8);
  rcc_periph_clock_enable(RCC_SPI2);
  rcc_periph_clock_enable(RCC_OTGFS);

  /* Wait for clock to spin up */
  rcc_wait_for_osc_ready(RCC_HSE);

  scb_set_priority_grouping(SCB_AIRCR_PRIGROUP_GROUP16_NOSUB);
  platform_init_scheduled_outputs();
  platform_init_eventtimer();
  platform_init_spi_adc();
  platform_init_pwm();
  platform_init_usb();

  dwt_enable_cycle_counter();

  setup_task_handler();
}

void sys_tick_handler(void) {
  run_tasks();
  iwdg_reset();
}

static void platform_disable_periphs() {
  rcc_periph_reset_pulse(RST_OTGFS);

  /* Shut down subsystems */
  rcc_periph_reset_pulse(RST_GPIOA);
  rcc_periph_clock_disable(RCC_GPIOA);

  rcc_periph_reset_pulse(RST_GPIOB);
  rcc_periph_clock_disable(RCC_GPIOB);

  rcc_periph_reset_pulse(RST_GPIOC);
  rcc_periph_clock_disable(RCC_GPIOC);

  rcc_periph_reset_pulse(RST_GPIOD);
  rcc_periph_clock_disable(RCC_GPIOD);

  rcc_periph_reset_pulse(RST_GPIOE);
  rcc_periph_clock_disable(RCC_GPIOE);

  rcc_periph_reset_pulse(RST_SYSCFG);
  rcc_periph_clock_disable(RCC_SYSCFG);

  rcc_periph_reset_pulse(RST_DMA1);
  rcc_periph_clock_disable(RCC_DMA1);

  rcc_periph_reset_pulse(RST_DMA2);
  rcc_periph_clock_disable(RCC_DMA2);

  rcc_periph_reset_pulse(RST_TIM1);
  rcc_periph_clock_disable(RCC_TIM1);

  rcc_periph_reset_pulse(RST_TIM2);
  rcc_periph_clock_disable(RCC_TIM2);

  rcc_periph_reset_pulse(RST_TIM3);
  rcc_periph_clock_disable(RCC_TIM3);

  rcc_periph_reset_pulse(RST_TIM6);
  rcc_periph_clock_disable(RCC_TIM6);

  rcc_periph_reset_pulse(RST_TIM7);
  rcc_periph_clock_disable(RCC_TIM7);

  rcc_periph_reset_pulse(RST_TIM8);
  rcc_periph_clock_disable(RCC_TIM8);

  rcc_periph_reset_pulse(RST_SPI2);
  rcc_periph_clock_disable(RCC_SPI2);

  rcc_periph_reset_pulse(RST_OTGFS);
  rcc_periph_clock_disable(RCC_OTGFS);
}

#define BOOTLOADER_ADDR 0x1fff0000
void platform_reset_into_bootloader() {
  handle_emergency_shutdown();

  platform_disable_periphs();

  /* 168 Mhz clock */
  rcc_clock_setup_pll(&rcc_hsi_configs[RCC_CLOCK_3V3_168MHZ]);

  __asm__ volatile("msr msp, %0" ::"g"(*(volatile uint32_t *)BOOTLOADER_ADDR));
  (*(void (**)())(BOOTLOADER_ADDR + 4))();
  while (1)
    ;
}

uint64_t cycle_count() {
  return dwt_read_cycle_counter();
}

uint64_t cycles_to_ns(uint64_t cycles) {
  return cycles * 1000 / 168;
}

/* This is now the lowest priority interrupt, with buffer swapping and sensor
 * reading interrupts being higher priority.  Keep scheduled callbacks quick to
 * keep scheduling delay low.  Currently nothing takes more than 15 uS
 * (rescheduling individual events).  All fueling calculations and scheduling is
 * now done in the ISR for trigger updates.
 */
void tim2_isr() {

  bool cc1_fired = false;
  bool cc2_fired = false;
  timeval_t cc1;
  timeval_t cc2;

  if (timer_get_flag(TIM2, TIM_SR_CC1IF)) {
    cc1_fired = true;
    cc1 = TIM2_CCR1;
    timer_clear_flag(TIM2, TIM_SR_CC1IF);
  }

  if (timer_get_flag(TIM2, TIM_SR_CC2IF)) {
    cc2_fired = true;
    cc2 = TIM2_CCR2;
    timer_clear_flag(TIM2, TIM_SR_CC2IF);
  }

  /* Did we miss a capture event? */
  if (timer_get_flag(TIM2, TIM_SR_CC1OF) ||
      timer_get_flag(TIM2, TIM_SR_CC2OF)) {
    timer_clear_flag(TIM2, TIM_SR_CC1OF);
    timer_clear_flag(TIM2, TIM_SR_CC2OF);
    decoder_desync(DECODER_OVERFLOW);
    return;
  }

  if (cc1_fired && cc2_fired && time_before(cc2, cc1)) {
    decoder_update_scheduling(1, cc2);
    decoder_update_scheduling(0, cc1);
  } else {
    if (cc1_fired) {
      decoder_update_scheduling(0, cc1);
    }
    if (cc2_fired) {
      decoder_update_scheduling(1, cc2);
    }
  }

  if (timer_get_flag(TIM2, TIM_SR_CC4IF)) {
    timer_clear_flag(TIM2, TIM_SR_CC4IF);
    scheduler_callback_timer_execute();
  }
}
void dma2_stream1_isr(void) {
  if (dma_get_interrupt_flag(DMA2, DMA_STREAM1, DMA_TCIF)) {
    dma_clear_interrupt_flags(DMA2, DMA_STREAM1, DMA_TCIF);
    stm32_buffer_swap();

    if (stm32_current_buffer() != dma_get_target(DMA2, DMA_STREAM1)) {
      /* We have overflowed or gone out of sync, abort immediately */
      abort();
    }
  }
}

volatile int interrupt_disables = 0;
void enable_interrupts() {
  interrupt_disables -= 1;
  assert(interrupt_disables >= 0);
  cm_enable_interrupts();
}

/* Returns current enabled status prior to call */
void disable_interrupts() {
  cm_disable_interrupts();
  interrupt_disables += 1;
}

