via/viaems/src/platforms/stm32f4-discovery.c
bool interrupts_enabled() {
  return !cm_is_masked_interrupts();
}

void schedule_event_timer(timeval_t time) {
  assert(!interrupts_enabled());
  /* Clear out any pending interrupt */
  timer_disable_irq(TIM2, TIM_DIER_CC4IE);
  timer_clear_flag(TIM2, TIM_SR_CC4IF);

  /* Set timer and enable interrupt */
  timer_set_oc_value(TIM2, TIM_OC4, time);
  timer_enable_irq(TIM2, TIM_DIER_CC4IE);

  /* If time is prior to now, we may have missed it, set the interrupt pending
   * just in case */
  if (time_before_or_equal(time, current_time())) {
    timer_generate_event(TIM2, TIM_EGR_CC4G);
  }
}

timeval_t current_time() {
  return timer_get_counter(TIM2);
}

int get_output(int output) {
  return gpio_get(GPIOD, (1 << output)) != 0;
}

void set_output(int output, char value) {
  if (value) {
    gpio_set(GPIOD, (1 << output));
  } else {
    gpio_clear(GPIOD, (1 << output));
  }
}

int get_gpio(int output) {
  return gpio_get(GPIOE, (1 << output)) != 0;
}

void set_gpio(int output, char value) {
  if (value) {
    gpio_set(GPIOE, (1 << output));
  } else {
    gpio_clear(GPIOE, (1 << output));
  }
}

extern unsigned _configdata_loadaddr, _sconfigdata, _econfigdata;
void platform_load_config() {
  volatile unsigned *src, *dest;
  for (src = &_configdata_loadaddr, dest = &_sconfigdata; dest < &_econfigdata;
       src++, dest++) {
    *dest = *src;
  }
}

void platform_save_config() {
  volatile unsigned *src, *dest;
  int n_sectors, conf_bytes;

  handle_emergency_shutdown();
  platform_disable_periphs();
  /* Flash erase takes longer than our watchdog */
  iwdg_set_period_ms(5000);

  flash_unlock();

  /* configrom is sectors 1 through 3, each 16k,
   * compute how many we need to erase */
  conf_bytes = ((char *)&_econfigdata - (char *)&_sconfigdata);
  n_sectors = (conf_bytes + 16385) / 16386;

  for (int sector = 1; sector < 1 + n_sectors; sector++) {
    flash_erase_sector(sector, 2);
  }
  for (dest = &_configdata_loadaddr, src = &_sconfigdata; src < &_econfigdata;
       src++, dest++) {
    flash_program_word((uint32_t)dest, *src);
  }

  flash_lock();
  reset_handler();
}

size_t console_read(void *buf, size_t max) {
  disable_interrupts();
  size_t amt = usb_rx_len > max ? max : usb_rx_len;
  memcpy(buf, usb_rx_buf, amt);
  memmove(usb_rx_buf, usb_rx_buf + amt, usb_rx_len - amt);
  usb_rx_len -= amt;
  enable_interrupts();
  return amt;
}

size_t console_write(const void *buf, size_t count) {
  size_t rem = count > 64 ? 64 : count;
  /* https://github.com/libopencm3/libopencm3/issues/531
   * We can't let the usb irq be called while writing */
  nvic_disable_irq(NVIC_OTG_FS_IRQ);
  __asm__("dsb");
  __asm__("isb");
  rem = usbd_ep_write_packet(usbd_dev, 0x82, buf, rem);
  nvic_enable_irq(NVIC_OTG_FS_IRQ);
  __asm__("dsb");
  __asm__("isb");
  return rem;
}

/* Use usb to send text from newlib printf */
ssize_t __attribute__((externally_visible))
_write(int fd, const char *buf, size_t count) {
  (void)fd;
  size_t pos = 0;
  while (pos < count) {
    pos += console_write(buf + pos, count - pos);
    usbd_poll(usbd_dev);
  }
  return count;
}

void __attribute__((externally_visible)) _exit(int status) {
  (void)status;

  handle_emergency_shutdown();
  while (1)
    ;
}

/* TODO: implement graceful shutdown of outputs on fault */
#define STACK_CHK_GUARD 0xe2dee396
uintptr_t __attribute__((externally_visible)) __stack_chk_guard =
  STACK_CHK_GUARD;

__attribute__((noreturn)) __attribute__((externally_visible)) void
__stack_chk_fail(void) {
  while (1)
    ;
}

void platform_freeze_timers() {
  timer_disable_counter(TIM8);
}

void platform_unfreeze_timers() {
  timer_enable_counter(TIM8);
}

uint32_t platform_adc_samplerate(void) {
#ifdef ADC_SAMPLE_RATE
  return ADC_SAMPLE_RATE;
#else
  return 0;
#endif
}
uint32_t platform_knock_samplerate(void) {
#ifdef KNOCK_SAMPLE_RATE
  return KNOCK_SAMPLE_RATE;
#else
  return 1000;
#endif
}
